[
    {
        "job": "Software Developer",
        "company": "IBM",
        "date": "July 2022 - Present",
        "location": "Cambridge, MA",
        "functions": [
        ],
        "class": "ibm"
    },
    {
        "job": "Software Developer Co-op",
        "company": "IBM",
        "date": "August 2021 - May 2022",
        "location": "Remote",
        "functions": [
            "Developed and deployed additional functions to the Security Learning Academy Portal (SLAP) with PHP and JavaScript to streamline the course lifecycle for Security Learning Services (SLS) content and ideation developers.",
            "Recorded, edited, and published virtual labs for the Security Learning Academy (SLA) with Adobe Captivate to emulate the experience of IBM Security products.",
            "Aided in the curation of SLS Process and Style Guides to ensure consistency of the courses on the SLA."
        ],
        "class": "ibm"
    },
    {
        "job": "Software Developer Intern",
        "company": "IBM",
        "date": "May 2021 - August 2021",
        "location": "Remote",
        "functions": [
            "Designed, developed, and implemented new web user interfaces (UI) with Adobe XD, HTML, CSS, and Bootstrap for the Security Learning Academy (SLA) website to parallel the elements of IBM’s Carbon Design System.", 
            "Examined the accessibility of SLA website against Web Content Accessibility Guidelines (WCAG) to improve end-user experience and usability.",
            "Customized presentation frameworks to assist Security Learning Services (SLS) content developers in demonstrating course learning materials to SLA clients."
        ],
        "class": "ibm"
    },
    {
        "job": "Undergraduate Information Technology Intern",
        "company": "TCW Group",
        "date": "June 2019 - August 2019",
        "location": "Los Angeles, CA",
        "functions": [
            "Transformed client relationship manager UI from Salesforce Classic to Salesforce Lightning Experience.",
            "Presented novel UI proof of concepts to TCW directors and senior managers.",
            "Facilitated in the deployment of new Salesforce UI to project managers."
        ],
        "class": "tcw"
    },
    {
        "job": "Science Ambassador",
        "company": "Rensselaer Polytechnic Institute",
        "date": "March 2019 - May 2022",
        "location": "Troy, NY",
        "functions": [
            "Member of the board: President",
            "Prepare and deliver presentations to educate local grade school students on relevant topics in STEM fields."
        ],
        "class": "rpi"
    }
]